package com.f14.TS.consts;

/**
 * 国家
 * 
 * @author F14eagle
 *
 */
public enum Country {
	/**
	 * 英国
	 */
	ENG,
	/**
	 * 加拿大
	 */
	CAN,
	/**
	 * 法国
	 */
	FRA,
	/**
	 * 挪威
	 */
	NOR,
	/**
	 * 卢比荷经济联盟
	 */
	LBH,
	/**
	 * 瑞典
	 */
	SWE,
	/**
	 * 丹麦
	 */
	DEN,
	/**
	 * 西德
	 */
	WGER,
	/**
	 * 意大利
	 */
	ITA,
	/**
	 * 西班牙/葡萄牙
	 */
	ESP,
	/**
	 * 希腊
	 */
	GRE,
	/**
	 * 土耳其
	 */
	TUR,
	/**
	 * 芬兰
	 */
	FIN,
	/**
	 * 奥地利
	 */
	AUT,
	/**
	 * 东德
	 */
	EGER,
	/**
	 * 波兰
	 */
	POL,
	/**
	 * 捷克斯洛伐克
	 */
	CZE,
	/**
	 * 匈牙利
	 */
	HUN,
	/**
	 * 南斯拉夫
	 */
	YUG,
	/**
	 * 罗马尼亚
	 */
	ROM,
	/**
	 * 保加利亚
	 */
	BUL,
	/**
	 * 叙利亚
	 */
	SYR,
	/**
	 * 黎巴嫩
	 */
	LIB,
	/**
	 * 以色列
	 */
	ISR,
	/**
	 * 约旦
	 */
	JOR,
	/**
	 * 埃及
	 */
	EGY,
	/**
	 * 利比亚
	 */
	LBA,
	/**
	 * 伊拉克
	 */
	IRQ,
	/**
	 * 伊朗
	 */
	IRI,
	/**
	 * 海湾诸国
	 */
	SOG,
	/**
	 * 沙特阿拉伯
	 */
	KSA,
	/**
	 * 阿富汗
	 */
	AFG,
	/**
	 * 巴基斯坦
	 */
	PAK,
	/**
	 * 印度
	 */
	IND,
	/**
	 * 朝鲜
	 */
	DPRK,
	/**
	 * 南韩
	 */
	KOR,
	/**
	 * 日本
	 */
	JPN,
	/**
	 * 台湾
	 */
	TW,
	/**
	 * 澳大利亚
	 */
	AUS,
	/**
	 * 缅甸
	 */
	BUR,
	/**
	 * 老挝/柬埔寨
	 */
	LAO,
	/**
	 * 泰国
	 */
	THA,
	/**
	 * 越南
	 */
	VIE,
	/**
	 * 马来西亚
	 */
	MAS,
	/**
	 * 印度尼西亚
	 */
	INA,
	/**
	 * 菲律宾
	 */
	PHI,
	/**
	 * 阿尔及利亚
	 */
	ALG,
	/**
	 * 突尼斯
	 */
	TUN,
	/**
	 * 摩纳哥
	 */
	MAR,
	/**
	 * 西非诸国
	 */
	SOWA,
	/**
	 * 科特迪瓦
	 */
	CIV,
	/**
	 * 撒哈拉国家共同体
	 */
	SAR,
	/**
	 * 尼日利亚
	 */
	NGR,
	/**
	 * 喀麦隆
	 */
	CMR,
	/**
	 * 扎伊尔
	 */
	ZAR,
	/**
	 * 安哥拉
	 */
	AGL,
	/**
	 * 南非
	 */
	RSA,
	/**
	 * 博茨瓦特
	 */
	BOT,
	/**
	 * 津巴布韦
	 */
	ZAPU,
	/**
	 * 非洲东南诸国
	 */
	SOSE,
	/**
	 * 肯尼亚
	 */
	KEN,
	/**
	 * 索马里
	 */
	SOM,
	/**
	 * 埃塞俄比亚
	 */
	ETH,
	/**
	 * 苏丹
	 */
	SUD,
	/**
	 * 墨西哥
	 */
	MEX,
	/**
	 * 危地马拉
	 */
	GTM,
	/**
	 * 萨尔瓦多
	 */
	ESA,
	/**
	 * 洪都拉斯
	 */
	HON,
	/**
	 * 尼加拉瓜
	 */
	NCA,
	/**
	 * 哥斯达黎加
	 */
	CRC,
	/**
	 * 古巴
	 */
	CUB,
	/**
	 * 巴拿马
	 */
	PAN,
	/**
	 * 海地
	 */
	HAT,
	/**
	 * 多明尼加
	 */
	DOM,
	/**
	 * 哥伦比亚
	 */
	COL,
	/**
	 * 委内瑞拉
	 */
	VEN,
	/**
	 * 厄瓜多尔
	 */
	ECU,
	/**
	 * 巴西
	 */
	BRA,
	/**
	 * 乌拉圭
	 */
	URU,
	/**
	 * 阿根廷
	 */
	AGR,
	/**
	 * 巴拉圭
	 */
	PAR,
	/**
	 * 智利
	 */
	CHI,
	/**
	 * 玻利维亚
	 */
	BOL,
	/**
	 * 秘鲁
	 */
	PER
}
